appbench/apps/RocksDB/parafs_vfs/fillrandom-readrandom_2_1024.txt
RocksDB:    version 5.4
Date:       Sat Jan 11 17:01:21 2020
CPU:        64 * Intel(R) Xeon(R) Gold 5218 CPU @ 2.30GHz
CPUCache:   22528 KB
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Keys:       20 bytes each
Values:     1024 bytes each (512 bytes after compression)
Entries:    500000
Prefix:    20 bytes
Keys per prefix:    0
RawSize:    497.8 MB (estimated)
FileSize:   253.7 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Memtablerep: prefix_hash
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
DB path: [/mnt/ram]
fillrandom   :       5.075 micros/op 197033 ops/sec;  196.2 MB/s
DB path: [/mnt/ram]
readrandom   :       2.482 micros/op 402829 ops/sec;  401.1 MB/s (500000 of 500000 found)